import { FaqData } from '@/components/MyPage/MyPageFaq/MyPageAccordion.types';

const FAQ_ITEM: FaqData[] = [
  {
    id: 1,
    title: '플랫폼에서 여행 계획을 어떻게 만들고 공유하나요?',
    desc: '여행 일정을 만들고 공유하려면 계정에 로그인하고 여행일정 탭에서 "여행 계획 짜기"를 클릭한 후 세부 정보를 입력하고 공유 옵션을 사용하여 동료 여행자에게 보내세요.',
  },
  {
    id: 2,
    title: '여행 계획을 다른 사람과 공유한 후에도 편집할 수 있나요?',
    desc: '예, 언제든지 여행 일정을 편집할 수 있습니다. "내 여행" 섹션으로 이동하여 원하는 여행을 선택한 후 "편집" 버튼을 클릭하세요. 변경 사항은 공유된 여행 일정에 자동으로 반영됩니다.',
  },
  {
    id: 3,
    title: '내 여행 계획을 보도록 다른 사람을 초대하려면 어떻게 해야 합니까?',
    desc: '여행 계획을 만든 후 "공유" 버튼을 클릭하고 고유한 링크 생성, 카카오톡을 통한 공유하기 등 제공되는 공유 옵션을 선택하세요. 수신자는 공유 링크를 통해 여행 계획에 액세스할 수 있습니다.',
  },
  {
    id: 4,
    title: '여행 계획과 후기를 다운로드하고 인쇄할 수 있나요?',
    desc: '예, 여행 계획과 후기의 상세페이지로 이동하면 찾을 수 있는 다운로드 아이콘을 클릭하여 PDF로 다운로드 후 인쇄할 수 있습니다.',
  },
  {
    id: 5,
    title: '여행 계획을 공유한 후 여행 계획이 변경되면 어떻게 되나요?',
    desc: '계획이 변경되면 필요에 따라 여행 계획을 업데이트하면 됩니다. 변경 사항은 여행 계획을 공유한 모든 사람에게 반영됩니다.',
  },
  {
    id: 6,
    title: '여행 일정(계획, 후기)를 오프라인으로 볼 수 있나요?',
    desc: '예, 오프라인 사용을 위해 PDF로 다운로드하여 오프라인으로 여행 일정에 액세스할 수 있습니다. 여행 일정 상세페이지에서 "다운로드" 옵션을 찾으세요.',
  },
  {
    id: 7,
    title: '플랫폼에 계정이 없는 사람과 내 여행 일정을 공유할 수 있나요?',
    desc: '예, 계정 보유 여부에 관계없이 누구와도 여행 일정을 공유할 수 있습니다. 접근성을 위해 링크나 카카오 톡 공유 같은 공유 옵션을 사용하세요.',
  },
  {
    id: 8,
    title: '여행 일정 공유 서비스 이용 시 수수료가 있나요?',
    desc: '여행일정 공유 서비스는 무료로 이용 가능합니다. ',
  },
  {
    id: 9,
    title: '내 계정 및 관련된 모든 여행 일정을 어떻게 삭제합니까?',
    desc: '계정 및 관련 여행 일정을 삭제하려면 My 페이지로 이동하여 회원 탈퇴하기 버튼을 클릭하여 모든 데이터를 삭제할 수 있습니다.',
  },
];

export default FAQ_ITEM;
